RT-Thread/rt-thread/bsp/stm32/libraries/HAL_Drivers/drivers/drv_usart_v2.c
#ifdef BSP_UART5_RX_USING_DMA
    uart_obj[UART5_INDEX].serial.config.dma_ping_bufsz  = BSP_UART5_DMA_PING_BUFSIZE;
    uart_obj[UART5_INDEX].uart_dma_flag                 |= RT_DEVICE_FLAG_DMA_RX;
    static const struct stm32_dma_config uart5_dma_rx   = UART5_DMA_RX_CONFIG;
    uart_config[UART5_INDEX].dma_rx                     = &uart5_dma_rx;
#endif

#ifdef BSP_UART5_TX_USING_DMA
    uart_obj[UART5_INDEX].uart_dma_flag                 |= RT_DEVICE_FLAG_DMA_TX;
    static const struct stm32_dma_config uart5_dma_tx   = UART5_DMA_TX_CONFIG;
    uart_config[UART5_INDEX].dma_tx                     = &uart5_dma_tx;
#endif
#endif

#ifdef BSP_USING_UART6
    uart_obj[UART6_INDEX].serial.config = config;
    uart_obj[UART6_INDEX].uart_dma_flag = 0;

    uart_obj[UART6_INDEX].serial.config.rx_bufsz = BSP_UART6_RX_BUFSIZE;
    uart_obj[UART6_INDEX].serial.config.tx_bufsz = BSP_UART6_TX_BUFSIZE;

#ifdef BSP_UART6_RX_USING_DMA
    uart_obj[UART6_INDEX].serial.config.dma_ping_bufsz  = BSP_UART6_DMA_PING_BUFSIZE;
    uart_obj[UART6_INDEX].uart_dma_flag                 |= RT_DEVICE_FLAG_DMA_RX;
    static const struct stm32_dma_config uart6_dma_rx   = UART6_DMA_RX_CONFIG;
    uart_config[UART6_INDEX].dma_rx                     = &uart6_dma_rx;
#endif

#ifdef BSP_UART6_TX_USING_DMA
    uart_obj[UART6_INDEX].uart_dma_flag                 |= RT_DEVICE_FLAG_DMA_TX;
    static const struct stm32_dma_config uart6_dma_tx   = UART6_DMA_TX_CONFIG;
    uart_config[UART6_INDEX].dma_tx                     = &uart6_dma_tx;
#endif
#endif

#ifdef BSP_USING_UART7
    uart_obj[UART7_INDEX].serial.config = config;
    uart_obj[UART7_INDEX].uart_dma_flag = 0;

    uart_obj[UART7_INDEX].serial.config.rx_bufsz = BSP_UART7_RX_BUFSIZE;
    uart_obj[UART7_INDEX].serial.config.tx_bufsz = BSP_UART7_TX_BUFSIZE;

#ifdef BSP_UART7_RX_USING_DMA
    uart_obj[UART7_INDEX].serial.config.dma_ping_bufsz  = BSP_UART7_DMA_PING_BUFSIZE;
    uart_obj[UART7_INDEX].uart_dma_flag                 |= RT_DEVICE_FLAG_DMA_RX;
    static const struct stm32_dma_config uart7_dma_rx   = UART7_DMA_RX_CONFIG;
    uart_config[UART7_INDEX].dma_rx                     = &uart7_dma_rx;
#endif

#ifdef BSP_UART7_TX_USING_DMA
    uart_obj[UART7_INDEX].uart_dma_flag                 |= RT_DEVICE_FLAG_DMA_TX;
    static const struct stm32_dma_config uart7_dma_tx   = UART7_DMA_TX_CONFIG;
    uart_config[UART7_INDEX].dma_tx                     = &uart7_dma_tx;
#endif
#endif

#ifdef BSP_USING_UART8
    uart_obj[UART8_INDEX].serial.config = config;
    uart_obj[UART8_INDEX].uart_dma_flag = 0;

    uart_obj[UART8_INDEX].serial.config.rx_bufsz = BSP_UART8_RX_BUFSIZE;
    uart_obj[UART8_INDEX].serial.config.tx_bufsz = BSP_UART8_TX_BUFSIZE;

#ifdef BSP_UART8_RX_USING_DMA
    uart_obj[UART8_INDEX].uart_dma_flag                 |= RT_DEVICE_FLAG_DMA_RX;
    static const struct stm32_dma_config uart8_dma_rx   = UART8_DMA_RX_CONFIG;
    uart_config[UART8_INDEX].dma_rx                     = &uart8_dma_rx;
#endif

#ifdef BSP_UART8_TX_USING_DMA
    uart_obj[UART8_INDEX].serial.config.dma_ping_bufsz  = BSP_UART8_DMA_PING_BUFSIZE;
    uart_obj[UART8_INDEX].uart_dma_flag                 |= RT_DEVICE_FLAG_DMA_TX;
    static const struct stm32_dma_config uart8_dma_tx   = UART8_DMA_TX_CONFIG;
    uart_config[UART8_INDEX].dma_tx                     = &uart8_dma_tx;
#endif
#endif

#ifdef BSP_USING_LPUART1
    uart_obj[LPUART1_INDEX].serial.config = config;
    uart_obj[LPUART1_INDEX].uart_dma_flag = 0;

    uart_obj[LPUART1_INDEX].serial.config.rx_bufsz = BSP_LPUART1_RX_BUFSIZE;
    uart_obj[LPUART1_INDEX].serial.config.tx_bufsz = BSP_LPUART1_TX_BUFSIZE;

#ifdef BSP_LPUART1_RX_USING_DMA
    uart_obj[LPUART1_INDEX].serial.config.dma_ping_bufsz    = BSP_LPUART1_DMA_PING_BUFSIZE;
    uart_obj[LPUART1_INDEX].uart_dma_flag                   |= RT_DEVICE_FLAG_DMA_RX;
    static const struct stm32_dma_config lpuart1_dma_rx     = LPUART1_DMA_CONFIG;
    uart_config[LPUART1_INDEX].dma_rx                       = &lpuart1_dma_rx;
#endif
#endif
}

#ifdef RT_SERIAL_USING_DMA
static rt_err_t stm32_uart_dma_config(struct rt_serial_device *serial, rt_ubase_t flag)
{
    DMA_HandleTypeDef *DMA_Handle;
    const struct stm32_dma_config *dma_config;
    struct stm32_uart *uart;

    RT_ASSERT(serial != RT_NULL);
    RT_ASSERT(flag == RT_DEVICE_FLAG_DMA_TX || flag == RT_DEVICE_FLAG_DMA_RX);
    uart = rt_container_of(serial, struct stm32_uart, serial);

    if (RT_DEVICE_FLAG_DMA_RX == flag)
    {
        DMA_Handle = &uart->dma_rx.handle;
        dma_config = uart->config->dma_rx;
    }
    else /* RT_DEVICE_FLAG_DMA_TX == flag */
    {
        DMA_Handle = &uart->dma_tx.handle;
        dma_config = uart->config->dma_tx;
    }
    LOG_D("%s dma config start", uart->config->name);

    if (RT_DEVICE_FLAG_DMA_RX == flag)
    {
        if (stm32_dma_setup(DMA_Handle,
                            &(uart->handle),
                            &uart->handle.hdmarx,
                            dma_config) != RT_EOK)
        {
            LOG_E("%s dma rx config failed", uart->config->name);
            return -RT_ERROR;
        }
    }
    else if (RT_DEVICE_FLAG_DMA_TX == flag)
    {
        if (stm32_dma_setup(DMA_Handle,
                            &(uart->handle),
                            &uart->handle.hdmatx,
                            dma_config) != RT_EOK)
        {
            LOG_E("%s dma tx config failed", uart->config->name);
            return -RT_ERROR;
        }
    }

    /* enable interrupt */
    if (flag == RT_DEVICE_FLAG_DMA_RX)
    {
        rt_uint8_t *ptr = NULL;
        rt_hw_serial_control_isr(serial, RT_HW_SERIAL_CTRL_GET_DMA_PING_BUF, (void *)&ptr);

        /* Start DMA transfer */
        if (HAL_UART_Receive_DMA(&(uart->handle), ptr, serial->config.dma_ping_bufsz) != HAL_OK)
        {
            /* Transfer error in reception process */
            LOG_E("%s uart dma rx start failed", uart->config->name);
            if (stm32_dma_deinit(DMA_Handle, dma_config, RT_FALSE) != RT_EOK)
            {
                LOG_E("%s uart dma rx rollback failed", uart->config->name);
            }
            uart->handle.hdmarx = RT_NULL;
            DMA_Handle->Parent = RT_NULL;
            return -RT_ERROR;
        }
        CLEAR_BIT(uart->handle.Instance->CR3, USART_CR3_EIE);
        __HAL_UART_ENABLE_IT(&(uart->handle), UART_IT_IDLE);
    }

    HAL_NVIC_SetPriority(uart->config->irq_type, 1, 0);
    HAL_NVIC_EnableIRQ(uart->config->irq_type);

    LOG_D("%s dma %s instance: %x", uart->config->name, flag == RT_DEVICE_FLAG_DMA_RX ? "RX" : "TX", DMA_Handle->Instance);
    LOG_D("%s dma config done", uart->config->name);

